<a href="https://colab.research.google.com/github/kmitsrinivas/kmitRep1/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np

In [ ]:
a=np.array([10.20,30,40])
print(a)

In [ ]:
a.ndim

In [ ]:
a.dtype

In [11]:
#np.arange(100)
np.arange(20,100,5)

array([20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95])

In [13]:
np.linspace(11,12,5 )

array([11.  , 11.25, 11.5 , 11.75, 12.  ])

In [14]:
np.zeros(10)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [15]:
np.ones(10)

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [16]:
a.ndim

1

In [22]:
a=np.array([[10,20,30,40],[1,2,3,4]])
print(a)

[[10 20 30 40]
 [ 1  2  3  4]]

In [23]:
a.ndim

2

In [26]:
import pandas as pd

In [30]:
df=pd.read_csv('iot.csv')

In [31]:
print(df)

     x    y    z  Gender
0   34  456   54    Male
1   22  554   56    Male
2   34  435  567  Female
3   34  456   98  Female
4   35  456  789  Female
5   26    4   76  Female
6  334   44   89  Female
7   89    4   77  Female
8   22    4    6  Female
9   35    5    4    Male

In [32]:
df.head()

    x    y    z  Gender
0  34  456   54    Male
1  22  554   56    Male
2  34  435  567  Female
3  34  456   98  Female
4  35  456  789  Female

In [33]:
df.tail()

     x   y   z  Gender
5   26   4  76  Female
6  334  44  89  Female
7   89   4  77  Female
8   22   4   6  Female
9   35   5   4    Male

In [34]:
df.shape

(10, 4)

In [36]:
df.slice(3)

AttributeError: ignored

In [37]:
df.[2:3]

SyntaxError: ignored

In [38]:
df[2:3]

    x    y    z  Gender
2  34  435  567  Female

In [39]:
df.head()

    x    y    z  Gender
0  34  456   54    Male
1  22  554   56    Male
2  34  435  567  Female
3  34  456   98  Female
4  35  456  789  Female

In [41]:
df[2:8]

     x    y    z  Gender
2   34  435  567  Female
3   34  456   98  Female
4   35  456  789  Female
5   26    4   76  Female
6  334   44   89  Female
7   89    4   77  Female

In [42]:
df[5:]

     x   y   z  Gender
5   26   4  76  Female
6  334  44  89  Female
7   89   4  77  Female
8   22   4   6  Female
9   35   5   4    Male

In [44]:
df[5:6]

    x  y   z  Gender
5  26  4  76  Female

In [45]:
df['x']

0     34
1     22
2     34
3     34
4     35
5     26
6    334
7     89
8     22
9     35
Name: x, dtype: int64

In [48]:
df['Gender']

0      Male
1      Male
2    Female
3    Female
4    Female
5    Female
6    Female
7    Female
8    Female
9      Male
Name: Gender, dtype: object